#Программа вычисляющая площадь треугольника
#Thinknetica курс Профессиональная разработка на RoR
#Урок 1

#Гем для изменения цвета текста. Если не установлен псевдографика отображаться не будет.


begin
	require 'colorize'
rescue LoadError => e
	PIC = "***Изображение треугольника недоступно***"
end


PIC ||=   "        /" + "|".red + "\\\n" +
   		  "       / " + "|".red + " \\\n" +
		  "      /  " + "|".red + "  \\ a\n" +
		  "     /   " + "|".red + "   \\\n" +
		  "    /" + "____".blue + "\u25A1".red + "____".blue + "\\\n" + 
		  "         h\n"
	  "\nВысота".red + "      Основание".blue

puts "Введите высоту и площадь основания треугольника\n\n"
puts PIC
puts

print "Основание    а = "
a = 0
while a == 0
a = STDIN.gets.chomp.to_f
 if a == 0
 	puts"Введите число не равное нулю"
 end
end

print "Высота       h = "
h = 0
while h == 0
h = STDIN.gets.chomp.to_f
 if a == 0
 	puts"Введите число не равное нулю"
 end
end

puts "Площадь треугольника равна:"
puts "(#{a} * #{h}) / 2 = #{a*h/2}"